# 실습데이터
library(tidyverse)
url <- "https://docs.google.com/spreadsheets/d/e/2PACX-1vQIGRAwCqdHohYKpkHNz10avinrvyoYKe0eSOol5_8wHxJEEfePoSwpyIiiku6JoDWXFQVDtqyMnBk-/pub?gid=0&single=true&output=csv"

#-----------------------------------------------------------------------
#  q1. 데이터를 가져와서 df 변수에 담아주세요
#-----------------------------------------------------------------------
df <- read.csv(url,encoding = 'UTF-8')
df <- read_csv(url)
#url 먼저 콘솔에 돌려야 함 ㅋㅋ

#-----------------------------------------------------------------------
#  q2. 컬럼이름을 영어로 변경해주세요
#      sido, name, y2018, y2019, value1, value2
#-----------------------------------------------------------------------
colnames(df) <- c("sido","name","y2018","y2019","value1","value2")

#-----------------------------------------------------------------------
#  q3. value1을 현재 문자형입니다. 수치형 데이터로 정제해보세요
#      ex) 3.29% -> 3.29
#-----------------------------------------------------------------------
as.numeric(str_remove(df$value1, "%"))
#_______mutate활용
df <- df %>%
    mutate(value1= as.numeric(str_remove(value1,"%")))
df$value1 <- as.numeric(str_remove(value1,"%"))

#df 유지

#-----------------------------------------------------------------------
#  q4. 226개 시군구 전체 평균 인상률을 얼마였나요?
#-----------------------------------------------------------------------
mean(df$value1)

#-----------------------------------------------------------------------
#  q4. 226개 시군구 전체 인상 금액 중간값은 얼마였나요?
#-----------------------------------------------------------------------
median(df$value2)

#-----------------------------------------------------------------------
#  q5. df_sample1에 sido, name 칼럼만 추출해서 담아보세요     
#-----------------------------------------------------------------------
df_sample1 <- df %>%
     select(contains("sido", "name"))

df_sample1 <- df %>%
    select(sido, name)


#-----------------------------------------------------------------------
#  q6. df_sample2에 value1(인상률)가 2.6이상만 담아보세요
#      (공무원 평균 인상률 2.6 기준)
#-----------------------------------------------------------------------
df_sample2 <- df %>%
    filter(value1 >= 2.6)

#-----------------------------------------------------------------------
#  q7. df_sample3에 새롭게 message란 열을 만들어서 그 안에 
#      name, value1을 활용해서 "강원도 강릉시의회는 3.29% 올랐습니다"
#      라고 넣어보세요
#-----------------------------------------------------------------------
df_sample3 <- df %>%
    mutate(message = str_c(name,"는 ",n," 올랐습니다"))

#-----------------------------------------------------------------------
#  q8. df_sample4에 226개 시도별(sido) 인상률 평균을 계산해보고
#      평균을 내림차순으로 정렬해보세요
#-----------------------------------------------------------------------
df_sample4 <- df %>%
    group_by(sido) %>%
    mutate(mean = mean(df$vaule1), sort = T)

df_sample4 <- df %>%
    group_by(sido) %>%
    summarise(평균=mean(value2,na.rm=TRUE)) %>%
    arrange(desc(평균))

#mutate는 기존 df에 추가 혹은 변경 
#summarise는 기존 df의 정보를 가지고 새로운 df 생성

#-----------------------------------------------------------------------
#  q9. df_sample5에 226개 시도별(sido) 인상 금액 중간값을 계산해보고
#      중간값을 오름차순으로 정렬해보세요
#-----------------------------------------------------------------------
df_sample5 <- df %>%
    group_by(sido) %>%
    summarise(중간값=median(value2)) %>%
    arrange(중간값)

#-----------------------------------------------------------------------
#  q10. df_sample1부터 df_sample5를 csv로 저장해보세요
#-----------------------------------------------------------------------
write_csv(df_sample1, "test1.csv")